# -*- coding: utf-8 -*-
"""ДЗ3_Кравченко Сергій.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1WngsKCM0vhudtxeuxImsqhOwJ7Iq7Z7Q

Дано 4 точки: $M_0(0, 0, 0), M_1(1, \frac{1}{3}, 0), M_2(0, 2, \frac{1}{4}), M_3(\frac{1}{2}, \frac{1}{2}, 1)$.

Також дано 3 вектори, які задають паралелепіпед із зазначеними точками:
- $\overline{a}=\overline{M_0M_1}$
- $\overline{b}=\overline{M_0M_2}$
- $\overline{c}=\overline{M_0M_3}$

Порахуй координати векторів через задані точки.  
Порахуй об'єм, площу повної поверхні паралелепіпеда та кути між ребрами паралелепіпеда, координати решти вершин паралелепіпеда.

Дано:
1. Точки:  
   $M_0(0, 0, 0), \quad M_1(1, \frac{1}{3}, 0), \quad M_2(0, 2, \frac{1}{4}), \quad M_3(\frac{1}{2}, \frac{1}{2}, 1)$  

2. Вектори:  
   $\overline{a} = \overline{M_0M_1}, \quad \overline{b} = \overline{M_0M_2}, \quad \overline{c} = \overline{M_0M_3}$

Знаходимо різницю координат відповідних точок $\quad M_1$, $\quad M_2$, $\quad M_3$, відносно $\quad M_0$,

1. Вектор $\overline{a}$:  
   $\overline{a} = (1 - 0, \frac{1}{3} - 0, 0 - 0) = \begin{pmatrix}
1, \frac{1}{3}, 0
\end{pmatrix}$

2. Вектор $\overline{b}$:  
   $\overline{b} = (0 - 0, 2 - 0, \frac{1}{4} - 0) = \begin{pmatrix}
0, 2, \frac{1}{4}
\end{pmatrix}$  

3. Вектор $\overline{c}$:  
   $\overline{c} = (\frac{1}{2} - 0, \frac{1}{2} - 0, 1 - 0) = \begin{pmatrix}
\frac{1}{2}, \
\frac{1}{2},1
\end{pmatrix}$

**Обчислення об'єму паралелепіпеда через скалярний потрійний добуток**  

$V = |\overline{a} \cdot (\overline{b} \times \overline{c})|$

Обчислення векторного добутку $\overline{b} \times \overline{c}$:  

 $\overline{b} \times \overline{c} = \begin{vmatrix}
\mathbf{i} & \mathbf{j} & \mathbf{k} \\
0 & 2 & \frac{1}{4} \\
\frac{1}{2} & \frac{1}{2} & 1
\end{vmatrix} =
\mathbf{i} \left(2 \cdot 1 - \frac{1}{4} \cdot \frac{1}{2}\right) -
\mathbf{j} \left(0 \cdot 1 - \frac{1}{4} \cdot \frac{1}{2}\right) +
\mathbf{k} \left(0 \cdot \frac{1}{2} - 2 \cdot \frac{1}{2}\right)$

Спрощуємо:  

$\overline{b} \times \overline{c} = \mathbf{i} \cdot \frac{15}{8} + \mathbf{j} \cdot \frac{1}{8} - \mathbf{k} \cdot 1 = \begin{pmatrix}
\frac{15}{8},
\frac{1}{8},
-1
\end{pmatrix}$

Обчислення скалярного добутку $\overline{a} \cdot (\overline{b} \times \overline{c})$:  

$\overline{a} \cdot (\overline{b} \times \overline{c}) = 1 \cdot \frac{15}{8} + \frac{1}{3} \cdot \frac{1}{8} + 0 \cdot (-1) = \frac{15}{8} + \frac{1}{24} = \frac{46}{24} = \frac{23}{12}$  

Отже, об'єм паралелепіпеда дорівнює:  

$V = \frac{23}{12} \, \text{одиниць кубічних}$

**Oбчислення площі повної поверхні паралелепіпеда**

Для обчислення площі повної поверхні паралелепіпеда, заданого трьома векторами $\overline{a}$, $\overline{b}$ та $\overline{c}$, скористаємося наступною формулою:  

$S = 2 \left( |\overline{a} \times \overline{b}| + |\overline{a} \times \overline{c}| + |\overline{b} \times \overline{c}| \right)$  

Ця формула враховує площі трьох пар протилежних граней паралелепіпеда. Кожна пара граней має однакову площу, тому ми множимо суму площ однієї грані кожної пари на 2.

### Крок 1: Обчислення векторних добутків  

Спочатку обчислимо векторні добутки між кожною парою векторів.  

1. Векторний добуток $\overline{a} \times \overline{b}$:  

$\overline{a} \times \overline{b} = \begin{vmatrix}
\mathbf{i} & \mathbf{j} & \mathbf{k} \\
1 & \frac{1}{3} & 0 \\
0 & 2 & \frac{1}{4}
\end{vmatrix} =
\mathbf{i} \left(\frac{1}{3} \cdot \frac{1}{4} - 0 \cdot 2\right) -
\mathbf{j} \left(1 \cdot \frac{1}{4} - 0 \cdot 0\right) +
\mathbf{k} \left(1 \cdot 2 - 0 \cdot \frac{1}{3}\right)$

$\overline{a} \times \overline{b} = \mathbf{i} \left(\frac{1}{12}\right) - \mathbf{j} \left(\frac{1}{4}\right) + \mathbf{k} \left(2\right) = \begin{pmatrix}
\frac{1}{12},
-\frac{1}{4}, \
2
\end{pmatrix}$


2. Векторний добуток $\overline{a} \times \overline{c}$:  

$\overline{a} \times \overline{c} = \begin{vmatrix}
\mathbf{i} & \mathbf{j} & \mathbf{k} \\
1 & \frac{1}{3} & 0 \\
\frac{1}{2} & \frac{1}{2} & 1
\end{vmatrix} =
\mathbf{i} \left(\frac{1}{3} \cdot 1 - 0 \cdot \frac{1}{2}\right) -
\mathbf{j} \left(1 \cdot 1 - 0 \cdot \frac{1}{2}\right) +
\mathbf{k} \left(1 \cdot \frac{1}{2} - \frac{1}{3} \cdot \frac{1}{2}\right)$

$\overline{a} \times \overline{c} = \mathbf{i} \left(\frac{1}{3}\right) - \mathbf{j} \left(1\right) + \mathbf{k} \left(\frac{1}{3}\right) = \begin{pmatrix}
\frac{1}{3}, -1,
\frac{1}{3}
\end{pmatrix}$

3. Векторний добуток $\overline{b} \times \overline{c}$:  

$\overline{b} \times \overline{c} = \begin{vmatrix}
\mathbf{i} & \mathbf{j} & \mathbf{k} \\
0 & 2 & \frac{1}{4} \\
\frac{1}{2} & \frac{1}{2} & 1
\end{vmatrix} =
\mathbf{i} \left(2 \cdot 1 - \frac{1}{4} \cdot \frac{1}{2}\right) -
\mathbf{j} \left(0 \cdot 1 - \frac{1}{4} \cdot \frac{1}{2}\right) +
\mathbf{k} \left(0 \cdot \frac{1}{2} - 2 \cdot \frac{1}{2}\right)$

$\overline{b} \times \overline{c} = \mathbf{i} \left(2 - \frac{1}{8}\right) - \mathbf{j} \left(-\frac{1}{8}\right) + \mathbf{k} \left(-1\right) = \begin{pmatrix}
\frac{15}{8},
\frac{1}{8}, -1
\end{pmatrix}$


Обчислення модулів векторних добутків  

Тепер знайдемо довжини кожного з отриманих векторів.  

1. Модуль $\overline{a} \times \overline{b}$:  

$|\overline{a} \times \overline{b}| = \sqrt{\left(\frac{1}{12}\right)^2 + \left(-\frac{1}{4}\right)^2 + (2)^2} =
\sqrt{\frac{1}{144} + \frac{1}{16} + 4} =
\sqrt{\frac{1}{144} + \frac{9}{144} + \frac{576}{144}} =
\sqrt{\frac{586}{144}} = \frac{\sqrt{586}}{12}$

2. Модуль $\overline{a} \times \overline{c}$:  

$|\overline{a} \times \overline{c}| = \sqrt{\left(\frac{1}{3}\right)^2 + (-1)^2 + \left(\frac{1}{3}\right)^2} =
\sqrt{\frac{1}{9} + 1 + \frac{1}{9}} =
\sqrt{\frac{2}{9} + 1} =
\sqrt{\frac{11}{9}} = \frac{\sqrt{11}}{3}$

3. Модуль $\overline{b} \times \overline{c}$:  

$|\overline{b} \times \overline{c}| = \sqrt{\left(\frac{15}{8}\right)^2 + \left(\frac{1}{8}\right)^2 + (-1)^2} =
\sqrt{\frac{225}{64} + \frac{1}{64} + 1} =
\sqrt{\frac{226}{64} + \frac{64}{64}} =
\sqrt{\frac{290}{64}} = \frac{\sqrt{290}}{8}$

**Обчислення площі повної поверхні паралелепіпеда**

Тепер підставимо знайдені модулі в формулу для площі поверхні:  

$S = 2 \left( |\overline{a} \times \overline{b}| + |\overline{a} \times \overline{c}| + |\overline{b} \times \overline{c}| \right) =
2 \left( \frac{\sqrt{586}}{12} + \frac{\sqrt{11}}{3} + \frac{\sqrt{290}}{8} \right)$


**Обчислення кутів між векторами**

1. Кут між $\overline{a}$ та $\overline{b}$:  

$\cos(\theta_{ab}) = \frac{\overline{a} \cdot \overline{b}}{|\overline{a}| \cdot |\overline{b}|} = \frac{2}{3} \cdot \frac{12}{\sqrt{650}} = \frac{24}{3\sqrt{650}} = \frac{8}{\sqrt{650}}$  

$\theta_{ab} = \arccos\left(\frac{8}{\sqrt{650}}\right) \approx \arccos(0.3137) \approx 71.7^\circ$

2. Кут між $\overline{a}$ та $\overline{c}$:  

$\cos(\theta_{ac}) = \frac{\overline{a} \cdot \overline{c}}{|\overline{a}| \cdot |\overline{c}|} = \frac{2}{3} \cdot \frac{6}{\sqrt{60}} = \frac{12}{3\sqrt{60}} = \frac{4}{\sqrt{60}} = \frac{4}{2\sqrt{15}} = \frac{2}{\sqrt{15}}$  

$\theta_{ac} = \arccos\left(\frac{2}{\sqrt{15}}\right) \approx \arccos(0.869) \approx 58.9^\circ$

3. Кут між $\overline{b}$ та $\overline{c}$:  

$\cos(\theta_{bc}) = \frac{\overline{b} \cdot \overline{c}}{|\overline{b}| \cdot |\overline{c}|} = \frac{5}{4} \cdot \frac{8}{\sqrt{390}} = \frac{40}{4\sqrt{390}} = \frac{10}{\sqrt{390}}$

$\theta_{bc} = \arccos\left(\frac{10}{\sqrt{390}}\right) \approx \arccos(0.5063) \approx 59.7^\circ$


### Формула для знаходження координат інших вершин  

Інші вершини можна знайти шляхом додавання відповідних векторів до заданих точок. Ось формули для знаходження координат:  

1. $M_4 = M_1 + \overline{b} = M_0 + \overline{a} + \overline{b}$  
2. $M_5 = M_1 + \overline{c} = M_0 + \overline{a} + \overline{c}$  
3. $M_6 = M_2 + \overline{c} = M_0 + \overline{b} + \overline{c}$  
4. $M_7 = M_1 + \overline{b} + \overline{c} = M_0 + \overline{a} + \overline{b} + \overline{c}$


### Обчислення координат інших вершин  

   **Визначення $M_4$**:  
   $M_4 = M_1 + \overline{b} = \left(1, \frac{1}{3}, 0\right) + \left(0, 2, \frac{1}{4}\right) =
   \left(1 + 0, \frac{1}{3} + 2, 0 + \frac{1}{4}\right) = \left(1, \frac{7}{3}, \frac{1}{4}\right)$

  **Визначення $M_5$**:  
   $M_5 = M_1 + \overline{c} = \left(1, \frac{1}{3}, 0\right) + \left(\frac{1}{2}, \frac{1}{2}, 1\right) =
   \left(1 + \frac{1}{2}, \frac{1}{3} + \frac{1}{2}, 0 + 1\right) = \left(\frac{3}{2}, \frac{5}{6}, 1\right)$  

  
  **Визначення $M_6$**:  
   $M_6 = M_2 + \overline{c} = \left(0, 2, \frac{1}{4}\right) + \left(\frac{1}{2}, \frac{1}{2}, 1\right) =
   \left(0 + \frac{1}{2}, 2 + \frac{1}{2}, \frac{1}{4} + 1\right) = \left(\frac{1}{2}, \frac{5}{2}, \frac{5}{4}\right)$

 **Визначення $M_7$**:  
   $M_7 = M_1 + \overline{b} + \overline{c} = \left(1, \frac{1}{3}, 0\right) + \left(0, 2, \frac{1}{4}\right) + \left(\frac{1}{2}, \frac{1}{2}, 1\right)
    = \left(\frac{3}{2}, \frac{17}{6}, \frac{5}{4}\right)$
"""

import numpy as np
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d.art3d import Poly3DCollection

# Визначення заданих точок
M0 = np.array([0, 0, 0])
M1 = np.array([1, 1/3, 0])
M2 = np.array([0, 2, 1/4])
M3 = np.array([1/2, 1/2, 1])

# Визначення векторів
a = M1 - M0
b = M2 - M0
c = M3 - M0

print("Вектори паралелепіпеда:")
print(f"a = {a}")
print(f"b = {b}")
print(f"c = {c}")

# Крок 1: Обчислення об'єму паралелепіпеда
# Об'єм = |a . (b x c)|
volume = abs(np.dot(a, np.cross(b, c)))
print(f"\nОб'єм паралелепіпеда: {volume} кубічних одиниць")

# Крок 2: Обчислення площі повної поверхні паралелепіпеда
# Площа поверхні = 2*(|a x b| + |a x c| + |b x c|)
surface_area = 2 * (np.linalg.norm(np.cross(a, b)) +
                   np.linalg.norm(np.cross(a, c)) +
                   np.linalg.norm(np.cross(b, c)))
print(f"Площа повної поверхні паралелепіпеда: {surface_area} квадратних одиниць")

# Крок 3: Обчислення кутів між ребрами паралелепіпеда
def angle_between_vectors(u, v):
    cos_theta = np.dot(u, v) / (np.linalg.norm(u) * np.linalg.norm(v))
    # Забезпечуємо, що значення cos_theta знаходиться в межах [-1, 1]
    cos_theta = np.clip(cos_theta, -1.0, 1.0)
    angle_rad = np.arccos(cos_theta)
    angle_deg = np.degrees(angle_rad)
    return angle_deg

angle_ab = angle_between_vectors(a, b)
angle_ac = angle_between_vectors(a, c)
angle_bc = angle_between_vectors(b, c)

print(f"\nКути між ребрами паралелепіпеда:")
print(f"Кут між a та b: {angle_ab:.2f}°")
print(f"Кут між a та c: {angle_ac:.2f}°")
print(f"Кут між b та c: {angle_bc:.2f}°")

# Крок 4: Обчислення координат інших чотирьох вершин паралелепіпеда
# Формули:
# M4 = M0 + a + b
# M5 = M0 + a + c
# M6 = M0 + b + c
# M7 = M0 + a + b + c

M4 = M0 + a + b
M5 = M0 + a + c
M6 = M0 + b + c
M7 = M0 + a + b + c

print("\nКоординати інших чотирьох вершин паралелепіпеда:")
print(f"M4 = {M4}")
print(f"M5 = {M5}")
print(f"M6 = {M6}")
print(f"M7 = {M7}")

# Крок 5: Візуалізація паралелепіпеда за допомогою Matplotlib

# Визначаємо всі вершини
vertices = np.array([M0, M1, M2, M3, M4, M5, M6, M7])

# Визначаємо грані паралелепіпеда (список вершин кожної грані)
# Кожна грань визначається чотирма вершинами
faces = [
    [0, 1, 5, 3],  # Грань M0-M1-M5-M3
    [0, 2, 6, 4],  # Грань M0-M2-M6-M4
    [0, 1, 4, 2],  # Грань M0-M1-M4-M2
    [1, 5, 7, 4],  # Грань M1-M5-M7-M4
    [2, 4, 7, 6],  # Грань M2-M4-M7-M6
    [3, 5, 7, 6]   # Грань M3-M5-M7-M6
]

# Створення об'єктів для візуалізації граней
poly3d = []
for face in faces:
    poly3d.append([vertices[face[0]], vertices[face[1]], vertices[face[2]], vertices[face[3]]])

# Створення 3D-фігури
fig = plt.figure(figsize=(10, 8))
ax = fig.add_subplot(111, projection='3d')

# Додавання граней до фігури
face_collection = Poly3DCollection(poly3d, facecolors='lightblue', linewidths=1, edgecolors='r', alpha=0.25)
ax.add_collection3d(face_collection)

# Додавання точок вершин
ax.scatter(vertices[:,0], vertices[:,1], vertices[:,2], color='red')

# Додавання міток до вершин
for i, txt in enumerate(['M0', 'M1', 'M2', 'M3', 'M4', 'M5', 'M6', 'M7']):
    ax.text(vertices[i,0], vertices[i,1], vertices[i,2], txt, size=12, zorder=1, color='k')

# Налаштування осей
ax.set_xlabel('X')
ax.set_ylabel('Y')
ax.set_zlabel('Z')

# Налаштування меж осей для кращої візуалізації
max_limit = np.max(vertices) + 1
min_limit = np.min(vertices) - 1
ax.set_xlim([min_limit, max_limit])
ax.set_ylim([min_limit, max_limit])
ax.set_zlim([min_limit, max_limit])

# Налаштування перспективи
ax.view_init(elev=20, azim=30)

# Відображення графіку
plt.title('Паралелепіпед з заданими вершинами')
plt.show()